data segment
;========
;y=a+b
;========
a dw ? 	; значение а - слово (два байта)
b dw ? 	; значение b - слово (два байта)
y dw ?     ;вычисляемое значение - - слово (два байта)
;===================
; конец сегмента данных
;===================
data ends
;===================
;сегмент кода
;===================
code segment
assume cs:code, ds:data, ss:nothing ;определение значений регистров сегментов кода, данных и стека
start:       	mov ax, data 	;load adress
	mov ds, ax 	;data segment           ;загрузка регистра сегмента данных
;=====================================================
; вычисление y=a+b
;=====================================================
	mov AX, a                  	;AX:=a из оперативной памяти
	mov BX, b                  	;BX:=b из оперативной памяти
	add AX, BX                	;АХ:=АХ-гВХ сложение регистров
	mov y, AX                  	;значение у помещается в оперативную память
;=================================================
; возврат в операционную систему
;=================================================
quit:       	mov ax, 4c00h		;cod to finish 0
	int 21 			;exit to dos (выход в dosbox) code ends
code ends
end start
